package com.example.yuehaoting.util

/**
 * 作者: 天使
 * 时间: 2021/6/27 13:57
 * 描述: 常量
 */
object MusicConstant {
//_______________________________________|Sp key|______________________________________________________________________________________________________
    const val NAME = "Setting"  //xml 文件
    const val PLAY_MODEL = "play_model"

    //自定义播放背景
    const val PLAYER_BACKGROUND = "player_background"
//_______________________________________|播放模式命令|______________________________________________________________________________________________________
    const val LIST_LOOP=1
    const val RANDOM_PATTERN=2
    const val SINGLE_CYCLE=3
//_______________________________________|播放界面常量|______________________________________________________________________________________________________
    //背景自适应颜色
    const val BACKGROUND_ADAPTIVE_COLOR = 1

    //上一首
    const val PREV=1
    //暂停播放
    const val PAUSE_PLAYBACK=2
    //下一首
    const val NEXT=3
//_______________________________________|歌手写真|______________________________________________________________________________________________________
    //歌手 id
    const val SINGER_ID="Singer_ID"
//_______________________________________|歌曲属性|______________________________________________________________________________________________________
    //歌曲名字
    const val SONG_NAME="SongName"
    //歌曲 歌手名字
    const val SINGER_NAME="SingerName"
}